/******************************************************************************
 * 跑马灯
 * P0.0 - P0.7 各接一个LED
 * P2.0 - P2.7  LED
 * P3.0 - P3.7  LED
 ******************************************************************************/

#include "reg52.h"			 //此文件中定义了单片机的一些特殊功能寄存器
#include <intrins.h>		//因为要用到左右移函数，所以加入这个头文件

typedef unsigned int u32;	  //对数据类型进行声明定义
typedef unsigned char u8;

#define led1 P0	   //将P0口定义为led1 后面就可以使用led1代替P0口
#define led2 P2
#define led3 P3

/*******************************************************************************
* 函 数 名		 : delay
* 函数功能		 : 延时函数，i=1时，大约延时10us
*******************************************************************************/
void delay(u32 i)
{
	while(i--);	
}

/*******************************************************************************
* 函 数 名 		 : main
* 函数功能		 : 主函数
* 输    入		 : 无
* 输    出    	 : 无
*******************************************************************************/
void main()
{
	u8 i = 0;
	u8 tmp_H = 0;
	u8 tmp_L = 0;
	
	led1 = 0x00;  //LED低电平点亮
	led2 = 0x00;
	led3 = 0x00;
	delay(50000); //大约延时450ms	
	led1 = ~0x00;  //LED低电平点亮，所以要取反
	led2 = ~0x00;
	led3 = ~0x00;

	
	while(1)
	{	
		/* 8个灯循环点亮和熄灭 */
		for(i = 0; i < 8; i++) 
		{
			led1 = ~(0x01 << i);	 //将1左移i位，然后将结果赋值到P0口，即切换要点亮的LED
			delay(10000);        //粗略的延时，自定义时长，约100ms
		}
		led1 = 0xff;
		/* 8个灯循环点亮和熄灭 */
		for(i = 0; i < 8; i++) 
		{
			led2 = ~(0x01 << i);	 //将1左移i位，然后将结果赋值到P2口，即切换要点亮的LED
			delay(10000);        //粗略的延时，自定义时长，
		}
		led2 = 0xff;
		/* 8个灯循环点亮和熄灭 */
		for(i = 0; i < 8; i++) 
		{
			led3 = ~(0x01 << i);	 //将1左移i位，然后将结果赋值到P3口，即切换要点亮的LED
			delay(10000);        //粗略的延时，自定义时长，
		}
		led3 = 0xff;
		
		/* 24个灯依次点亮和熄灭（亮8个），流水灯 */
		for(i = 0; i < 24 + 8; i++)
		{
			if(i < 8)
			{
				/* 将0左移i位，然后与P0按位与，即点亮下一个LED，保持前面点亮的LED状态不变 */
				led1 = led1 & ~(0x01 << i);
				delay(10000);
			}
			if(i >= 8 && i < 16)
			{
				/* 将1左移i位，然后和P0按位或，即点亮下一个LED，保持前面点亮的LED状态不变 */
				led1 = led1 | 0x01 << (i - 8); 	
				/* 将0左移i位，然后与P2按位与，即点亮下一个LED，保持前面点亮的LED状态不变 */
				led2 = led2 & ~(0x01 << (i - 8)); 
				delay(10000);
			}
			if(i >= 16 && i < 24)
			{
				/* 将1左移i位，然后和P2按位或，即点亮下一个LED，保持前面点亮的LED状态不变 */
				led2 = led2 | 0x01 << (i - 16); 	
				/* 将0左移i位，然后与P3按位与，即点亮下一个LED，保持前面点亮的LED状态不变 */
				led3 = led3 & ~(0x01 << (i - 16)); 
				delay(10000);
			}
			if(i >= 24)
			{
				/* 将1左移i位，然后和P3按位或，即点亮下一个LED，保持前面点亮的LED状态不变 */
				led3 = led3 | 0x01 << (i - 24); 	
				delay(10000);
			}
		}
		
		
		/* 兵分两路 */
		for(i = 0; i < 12; i++)
		{
			if(i < 8)
			{
				led1 = ~(0x01 << i);	 //将1左移i位，然后将结果赋值到P0口，即切换要点亮的LED
				led3 = ~(0x80 >> i);     //将0x80右移i位
				delay(10000);        //粗略的延时，自定义时长，
			}
			if(i >= 8)
			{
				led1 = 0xff;  //灭
				led3 = 0xff;
				tmp_L = ~(0x01 << (i - 8)); //将led2的0-3号灯中选一个点亮
				tmp_H = ~(0x80 >> (i - 8)); //7-4号灯中选一个点亮
				led2 = (tmp_L & 0x0f) | (tmp_H & 0xf0);
				delay(10000);        //粗略的延时，自定义时长，
			}
		}
		led2 = 0xff;
	}		
}
